-- 既存データの削除
DELETE FROM plant_areas;
DELETE FROM ridges;
DELETE FROM farmlands;
DELETE FROM vegetables;

-- 野菜データの投入
INSERT INTO vegetables (id, name, family, height, unit_width, unit_height)
VALUES
  (1, 'サツマイモ', 'ヒルガオ科', 30, 45, 30),
  (2, 'トウモロコシ', 'イネ科', 200, 60, 30),
  (3, 'ミニトマト', 'ナス科', 180, 60, 50),
  (4, 'オクラ', 'アオイ科', 120, 60, 30),
  (5, 'ピーマン', 'ナス科', 70, 60, 45),
  (6, 'キュウリ', 'ウリ科', 180, 60, 50),
  (7, 'ナス', 'ナス科', 90, 60, 50),
  (8, '枝豆', 'マメ科', 60, 40, 30),
  (9, 'ジャガイモ', 'ナス科', 60, 60, 30),
  (10, 'カボチャ', 'ウリ科', 40, 100, 90),
  (11, 'イチゴ', 'バラ科', 30, 30, 30),
  (12, 'タマネギ', 'ヒガンバナ科', 40, 15, 15),
  (13, 'ホウレンソウ', 'ヒユ科', 25, 15, 15),
  (14, 'ダイコン', 'アブラナ科', 40, 30, 30),
  (15, 'キャベツ', 'アブラナ科', 40, 45, 45),
  (16, 'ブロッコリー', 'アブラナ科', 60, 45, 45),
  (17, 'スナップエンドウ', 'マメ科', 180, 60, 20),
  (18, 'コマツナ', 'アブラナ科', 25, 15, 15),
  (19, 'ハツカダイコン', 'アブラナ科', 20, 10, 10),
  (20, 'ソラマメ', 'マメ科', 80, 60, 40);
